Revit 2027 API
UIApplication.OpenAndActivateDocument Method
Overload List
Name | Description
OpenAndActivateDocument(String) |  Opens and activates a Revit document.
OpenAndActivateDocument(ModelPath, OpenOptions, Boolean) |  Opens and activates a Revit document, include both local document or cloud document.
OpenAndActivateDocument(ModelPath, OpenOptions, Boolean, IOpenFromCloudCallback) |  Opens and activates a Revit document, include both local document or cloud document.
Top
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace